// BSLLS:PublicMethodsDescription-off
// BSLLS:MissingParameterDescription-off
// BSLLS:MissingReturnedValueDescription-off
// Фейки опросчика и экспортеров кластера, которым передают вызовы верховные желуди ПодменаКластера.

Перем ТекущийОпросчик; // ФейковыйОпросчикКластера
Перем ТекущийЭкспортер; // ФейковыйЭкспортерМетрикКластера
Перем ТекущийЭкспортерСеансов; // ФейковыйЭкспортерСеансовКластера

Процедура Подставить(Опросчик, Экспортер, ЭкспортерСеансов) Экспорт
	ТекущийОпросчик = Опросчик;
	ТекущийЭкспортер = Экспортер;
	ТекущийЭкспортерСеансов = ЭкспортерСеансов;
КонецПроцедуры

Функция Опросчик() Экспорт
	Возврат ТекущийОпросчик;
КонецФункции

Функция Экспортер() Экспорт
	Возврат ТекущийЭкспортер;
КонецФункции

Функция ЭкспортерСеансов() Экспорт
	Возврат ТекущийЭкспортерСеансов;
КонецФункции
